Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །བྱམས་སེམས་ལས་བྱུང་དགའ་བ་ཡི། །དཔེ་ཟླ་དག་ནི་ཡོང་མེད་དོ།
en: Nothing can compare to the joy That arises on the basis of love.

source: །ཇི་ལྟར་རྒྱལ་པོས་ཉེས་བྱུང་བ། །ཡན་ལག་གཏུབས་ཞེས་བསྒོ་བས་ན།
en: “Take the example of a king who orders The limbs of a criminal to be cut off.

source: །གསོད་པས་གསད་སར་ཁྲིད་ནས་ནི། །མཚོན་གྱིས་གདབ་པར་གཟས་པ་དང་། །རྒྱལ་པོས་ལོངས་སྤྱོད་ཐབས་བྱིན་ན། །མི་དེའི་རབ་ཏུ་དགའ་བས་ཀྱང་།
en: When the executioner has led him to the scaffold And is about to strike him with his weapon, “The king may pardon him and let him live. In that case, the man will be utterly overjoyed.

source: །བྱང་ཆུབ་སེམས་དཔས་ཕོངས་པ་ལ། །སྦྱིན་བཏང་དགའ་བ་ཙམ་མི་ཕོད། །
en: Still, even that joy cannot match the delight Of bodhisattvas who are generous toward destitute beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ལམ་སྒོམ་ཚེ། །བསོད་ནམས་ཞིང་ནི་མི་ཚོལ་གྱི།
en: “When bodhisattvas cultivate the path, They do not search for a field of merit.

source: །སློང་བ་ཡོད་ན་གཏོང་བྱེད་པས།
en: Rather, if a beggar is present, they practice generosity,

source: །དེ་ཕྱིར་དགའ་བ་ཆེན་པོ་ཐོབ།
en: Thereby reaching a state of immense joy.

source: །བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་དང་། །དགྲ་བཅོམ་རང་རྒྱལ་མཐོང་གྱུར་ན། །གུས་སེམས་ཕྲད་དཀའ་རིག་པས་ན། །དེ་ཕྱིར་དྲུང་འགྲོ་མཆོད་པར་བྱེད།
en: “When bodhisattvas see buddhas, Worthy ones, or solitary buddhas, They will respectfully approach them and worship them, Since they know that they are hard to meet.

source: །བྱང་ཆུབ་སེམས་དཔའ་གཟི་བྱིན་ལྡན།
en: “Because bodhisattvas are majestic, brilliant, and sharp,

source: །གསལ་རྣོ་སེམས་ནི་དུལ་བས་ན།
en: And because their minds are gentle,

source: །ཡོན་ཏན་མོས་ཤིང་ལམ་གཉེར་ཕྱིར།
en: They aspire to develop excellent qualities, pursue the path,

source: །སངས་རྒྱས་དགེ་འདུན་མཆོད་པར་བྱེད།
en: And worship the Buddha and the Saṅgha.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། །དེ་ཡི་ཉན་ཐོས་མ་གཏོགས་པར།
en: “They worship the blessed buddhas, As well as their hearers,

source: །ལྷག་པའི་བསམ་དང་གུས་སེམས་ཀྱིས།
en: With altruism and respect.

source: །ལྷ་ཀླུ་གཞན་ནི་མཆོད་མི་བྱེད། །
en: But they do not worship others, such as gods and spirits.

source: གལ་ཏེ་རང་རྒྱལ་འགའ་ཞིག་གིས།
en: “When they see some of the solitary buddhas

source: །རང་བྱུང་མྱ་ངན་འདས་ཐོབ་པ།
en: Who have independently attained nirvāṇa

source: །དེ་འདྲའི་ཡོན་ཏན་བདེན་མཐོང་ན།
en: And who possess such qualities,

source: །དེ་ལ་ཡང་ནི་མཆོད་པ་བྱེད།
en: They worship them as well.

source: །བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཞིང་། །དགེ་དང་མི་དགེ་རིག་པས་ན།
en: “Because bodhisattvas know the virtuous or nonvirtuous characters Of the fields of merit,

source: །འཇིག་རྟེན་མཁས་པ་གང་ཡིན་པའི།
en: Those who are wise in the world

source: །མུ་སྟེགས་སྡིག་ཅན་མཆོད་མི་བྱེད།
en: Do not worship evil extremists.

source: །ཚུལ་ཁྲིམས་ཕྱོགས་ལ་རབ་གནས་ཤིང་།
en: “They carefully maintain their discipline,

source: །བྱམས་སེམས་སེམས་ཅན་ཀུན་ལ་ཁྱབ།
en: Their love pervades all sentient beings,

source: །བརྩོན་འགྲུས་དག་ཀྱང་དཔེ་ཟླ་མེད།
en: Their diligence is matchless,

source: །བཟོད་ཤེས་མང་ཐོས་རྒྱ་ཡང་ཆེ།
en: And they are endowed with immense patience, insight, and erudition.

source: །དེ་འདྲའི་ཡོན་ཏན་ལྡན་པས་ན།
en: “Since they possess such qualities,

source: །འཇིག་རྟེན་ཀུན་གྱི་གཙོར་གྱུར་ནས།
en: They become leaders of all worlds.

source: །སངས་རྒྱས་བྱང་ཆུབ་མངོན་བྱས་ཏེ།
en: They actualize the awakening of the buddhas

source: །བླ་མེད་འཁོར་ལོ་སྐོར་བར་བྱེད།
en: And turn the unsurpassed wheel.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་འདྲ་ཡི། །ཆོས་བཞི་དག་ནི་སྒྲུབ་བྱེད་ན། །དགེ་བའི་རྩ་བ་ཇི་སྙེད་པ། །ཐམས་ཅད་ཀུན་ནི་མངོན་དུ་འགྱུར།
en: “If bodhisattvas accomplish These four qualities, All the roots of virtue Will manifest.

source: །བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །ཡོན་ཏན་རྣམས་ནི་གང་བསྒྲུབས་པ། །དེ་ཀུན་བྱང་ཆུབ་སེམས་དཔའི་ལམ། །འདིར་ནི་བསྡུ་བར་བྱ་བ་ཡིན།
en: “All the excellent qualities that are accomplished Over countless millions of eons Are included here Within this bodhisattva path.

source: །དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །རྟག་ཏུ་བྱམས་སེམས་བསྒོམ་པར་བྱ།
en: “Therefore, bodhisattvas Should always cultivate love.

source: །རབ་བྱུང་རི་དང་ཚལ་གནས་ཤིང་། །དགོན་པའི་གནས་ལ་མོས་པར་བྱ།
en: They should aspire to go forth And remain in mountains, forests, or remote places.

source: །རྟག་པར་ཤིན་དུ་རྣམ་དག་ཅིང་།
en: “Constantly pursuing the pristinely pure,

source: །ཟབ་མོ་ངེས་པའི་ཆོས་བཙལ་ཏེ།
en: Profound, and definitive Dharma,

source: །བྱང་ཆུབ་སྤྱོད་དང་ལྡན་བྱས་ནས། །དེ་ཡི་བདག་ཉིད་འཕེལ་བར་བྱ།
en: They should develop themselves By observing bodhisattva conduct.”

source: །དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This was the fourth chapter, The Possession of Roots of Virtue.

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་གྱི་མཐུས་སྐུའི་སྤུའི་བུ་ག་ཀུན་ནས་འོད་ཟེར་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་དུ་མ་བཀྱེའོ།
en: Then, through the power of the Blessed One’s miraculous abilities, many trillions of light rays radiated from the pores of his skin.

source: །གཞན་ཡང་སྤུའི་བུ་ག་རེ་རེ་ཀུན་ནས་མེ་རབ་ཏུ་འབར་བའི་ཕུང་པོ་རི་རབ་ལྷུན་པོ་དང་མཉམ་པ་དག་བྱུང་བར་གྱུར་ཏོ།
en: Masses of blazing fire as huge as Mount Sumeru also emerged from each of his pores;

source: །གཞན་ཡང་སྤུའི་བུ་ག་རེ་རེ་ཀུན་ནས་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པར་མཛད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱུང་བར་གྱུར་ཏེ།
en: and thus-gone ones teaching the Dharma, as numerous as all the grains of sand in the Ganges river, also emerged from each pore.

source: འཁོར་འདུས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་མཐུ་བསྟན་པ་མཐོང་བར་གྱུར་ཏོ།
en: The entire assembly present witnessed these miraculous displays.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་དེ་ལྟ་བུ་མངོན་དུ་མཛད་ནས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་བཀའ་སྩལ་པ། གང་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྤུའི་བུ་ག་ནས་བྱུང་བའི་རྫུ་འཕྲུལ་གྱི་མཐུ་མཐོང་ངམ།
en: After the Blessed One had manifested them, he asked the venerable Pūrṇa, “Pūrṇa, did you see the power of the miraculous displays coming from the pore of each body hair of the Thus-Gone One?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: “Blessed One, I saw it,” replied Pūrṇa.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པར་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་མཐུ་དང་ལྡན་པ་རྒྱུན་ཆད་པ་མེད་པ་ཡིན་ན་དེང་ཉན་ཐོས་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་འདི་འབའ་ཞིག་ཏུ་བཞུགས་ནས་ཆོས་འཆད་པར་མཐོང་སྟེ།
en: “Pūrṇa,” continued the Blessed One, “the Thus-Gone One always possesses, uninterruptedly, the power of such miraculous displays. Nevertheless, the hearers perceive only the Thus-Gone One sitting here and explaining the Dharma.

source: ད་ནི་ཡང་དག་པར་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀུན་དུ་རྒྱུན་ཆད་པ་མེད་པར་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་ཅིང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་དེ་བཞིན་དུ་ཆོས་སྟོན་པར་མཛད་དེ།
en: But right now, he is genuinely performing the deeds of a buddha uninterruptedly, within all the universes of the ten directions, as numerous as the grains of sand in the Ganges river. Similarly, he is teaching the Dharma within all the universes of the ten directions.

source: གང་པོ་གལ་ཏེ་འགའ་ཞིག་ཡང་དག་པའི་ཚིག་གིས་འདི་སྐད་དུ་མཚུངས་པ་མེད་ཅིང་དཔེ་ཟླ་མེད་པ་རྐང་གཉིས་ཀྱི་མཆོག །བསོད་ནམས་ཀྱི་ཞིང་ཤིན་ཏུ་ཟབ་ཅིང་དཔག་པར་དཀའ་བ། སྤྱོད་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ། གོམ་པ་གཅིག་བོར་ན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སེམས་གང་དང་། སྤྱོད་པ་གང་གིས་རྐང་པ་བཏེག་ཅིང་བཞག་པ་ཤེས་པར་ཡང་མི་འགྱུར་ལ་གཞལ་བར་མི་ནུས་པ་དེ་གང་ཡིན་ཞེས་ཟེར་ན། དེ་ནི་ང་ཡིན་ནོ་ཞེས་སྨྲ་བར་བྱ་སྟེ། གང་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་དགོངས་པ་གང་དང་། བསམ་པ་གང་དང་། སྤྱོད་པ་གང་གིས་ཞབས་བཏེག་པ་དང་ཞབས་བཞག་པ་གཞལ་བར་མི་ནུས་པས་སོ།
en: Pūrṇa, someone may say, correctly, ‘That peerless and matchless being, that supreme human, that extremely profound and immeasurable field of merit, whose conduct is measureless, and of whom, even as he takes but a single step, no other being is able to fathom the motive and conduct involved in that act of lifting his foot and placing it down—who is that?’ If someone were to ask that question, I would have to answer, ‘I am.’ Pūrṇa, no sentient being is able to assess the intent, motive, or conduct involved in the Thus-Gone One’s act of lifting and setting down a single foot.”

source: བཅོམ་ལྡན་དགོངས་པ་གང་དག་དང་། །སྤྱོད་པ་གང་གིས་ཞབས་བཏེག་བཞག །གཡོ་དང་མི་གཡོ་སེམས་ཅན་གྱིས། །དངོས་པོ་འདི་ནི་རྟག་མི་རིག །
en: “Sentient beings, whether moving or unmoving, Can never know such matters as the intentions or behavior involved In a single step of the Blessed One’s feet.

source: རྫུ་འཕྲུལ་མཐུ་ཡང་ཚད་མེད་དེ། །སྤྱོད་པ་དག་ཀྱང་ཚད་མེད་དོ།
en: “His miracles are boundless, And so is his conduct.

source: །ཡོན་ཏན་དག་ནི་ཚད་མེད་ཕྱིར། །མཆོག་ཏུ་མཐོ་ཞིང་གཙོ་བོར་གྱུར།
en: Since his qualities are also boundless, He is supremely exalted, the chief among beings.

source: །བློ་གྲོས་ཆེན་པོ་ཚད་མེད་པས། །སུས་ཀྱང་མཐར་ཐུག་ཤེས་མི་འགྱུར།
en: “Since his great wisdom is immeasurable, No one can understand its full scope.

source: །གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཀུན། །ཤེས་རབ་དང་ནི་རྫུ་འཕྲུལ་སྟོབས། །ཐམས་ཅད་ཤཱ་རིའི་བུ་དང་ནི། །མཽད་གལ་ལྟ་བུར་གྱུར་ཀྱང་ནི། །ང་ཡིས་རྐང་པ་བཏེག་བཞག་པའི། །དངོས་པོ་དག་ནི་རིག་མི་འགྱུར།
en: Even if all beings possessed The powers of insight and miracles, “Like Śāriputra And Maudgalyāyana, They could not understand My act of lifting and placing down my foot.

source: གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་ཀུན། །རང་རྒྱལ་བྱང་ཆུབ་གྲུབ་གྱུར་ཀྱང་། །ང་ཡི་གོམ་གཅིག་མི་རིག་ན། །ཆོས་ཟབ་གཞན་ལྟ་སྨོས་ཅི་དགོས།
en: “Even if all sentient beings Attained the awakening of the solitary buddhas, They would know nothing of even a single step of mine, Let alone of my other profound qualities.

source: །ཉི་ཟླ་ཚད་མེད་ཇི་སྙེད་པ། །ཉི་མའི་དཀྱིལ་འཁོར་གཅིག་གྱུར་ཀྱང་། །དེ་བཞིན་གཤེགས་པའི་སྤུ་ཁུང་གཅིག །འོད་ཟེར་ཙམ་ཡང་མི་ཕོད་དོ།
en: “Even if all the limitless suns and moons Combined into a single sun-disk, Its light could not match the light of a single light ray Radiating from a pore of a hair of the Thus-Gone One.

source: །གལ་ཏེ་འཇིག་རྟེན་ཁམས་བྱེ་བ། །ཁྲག་ཁྲིག་ཕྲག་ནི་བདུན་ཁྲི་ཡི། །ཉི་མའི་དཀྱིལ་འཁོར་ཀུན་ཏུ་ཡང་། །ཞིང་ནི་ཚད་མེད་སྣང་བྱེད་པ།
en: “Take as an illustration All the suns in seven quadrillion universes, Which illuminate countless realms In a limitless manner.

source: །དེ་འདྲའི་ཉི་མ་ཆེན་པོ་དག །ཕྱོགས་བཅུ་གང་གཱའི་བྱེ་མ་སྙེད། །ཐམས་ཅད་ཉི་མ་གཅིག་ཏུ་གྱུར། །འོད་ཟེར་གཅིག་ཀྱང་རི་རབ་ཙམ།
en: “Imagine that all those great suns in the ten directions, As numerous as all the grains of sand in the Ganges, Were joined to form a single sun, From which a single light ray was as large as Mount Sumeru.

source: །དེ་འདྲའི་ཉི་མ་ཆེན་པོ་དག །རྟག་པར་ཕྱོགས་བཅུ་གསལ་བྱེད་པ། །སངས་རྒྱས་འོད་དང་བསྒྲུན་གྱུར་ན། །སྡོང་པོ་ཚིག་བཞིན་སྣང་མི་འགྱུར།
en: “If the light of such a great sun, Which constantly illuminates the ten directions, Were compared to the light of the Buddha, The sun would barely be visible, like a burning tree.

source: །ཉི་མ་ཆེན་པོ་དེ་ཡི་འོད། །ལྗོན་ཤིང་ལོ་མ་མི་ཐལ་ཞིང་། །རི་དང་ཀླུང་དང་བྲག་རྣམས་ལ། །ཐམས་ཅད་དུ་ནི་ཐོགས་པར་འགྱུར།
en: “The light of that great sun Would not shine through trees and leaves; It would be obstructed By all the mountains, rivers, and rocks.

source: །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་ནི། །རི་རབ་དང་ནི་ལྕགས་རི་དང་། །རྡོ་རྗེ་རི་ནི་ཐམས་ཅད་ལ། །ཐལ་བར་འགྲོ་ཞིང་ཐོགས་པ་མེད།
en: “On the other hand, the light rays emanated by the Thus-Gone One Shine unobstructedly Through Mount Sumeru, As well as through all the iron and vajra mountains.

source: །འོད་ཟེར་རྫུ་འཕྲུལ་མཐུ་སྟོབས་དང་། །གཟི་བྱིན་དག་ནི་ཚད་མེད་པས། །ཡིད་ཆེས་མེད་པ་མ་གཏོགས་པར། །མཐོང་བ་སུ་ཞིག་སེམས་མི་སྐྱེད།
en: “Since his light, emanated by his miraculous power, Along with his majestic presence, is immeasurable, Except for those who lack trust, Who would not arouse the mind set on awakening upon seeing it?

source: །སེམས་ཅན་དེ་འདྲའི་འོད་ཟེར་དང་། །རྫུ་འཕྲུལ་མཐུ་ཆེན་མཐོང་འགྱུར་ན། །བདག་ཅག་ཀྱང་ནི་ཐོབ་འགྱུར་ཞེས། །ཕལ་ཆེར་བླ་མེད་སེམས་ཀྱང་སྐྱེད། །དེ་ཚེ་བཅོམ་ལྡན་འཛུམ་མཛད་ནས།
en: “When sentient beings see these light rays And the great power of these magical displays, Most of them give rise to the unsurpassed mind set on awakening With the thought, ‘We must also reach that state!’ ”

source: །ཀུན་དགའ་བོས་ནི་འདི་སྐད་གསོལ། །གང་སླད་བཅོམ་ལྡན་འཛུམ་པ་མཛད།
en: At that moment, the Blessed One smiled, And Ānanda asked,

source: །ཐོགས་མེད་མཁྱེན་པས་བཀས་བཤད་གསོལ།
en: “Blessed One, why are you smiling? You who possess unimpeded wisdom, please tell us!”

source: །བཅོམ་ལྡན་ཀུན་དགའ་བཀའ་སྩལ་པ།
en: The Blessed One answered:

source: །སེམས་ཅན་རྣམས་ཀྱིས་དེང་ང་ཡིས། །རྫུ་འཕྲུལ་མཐུ་བསྟན་མཐོང་བས་ན། །སེམས་བསྐྱེད་སངས་རྒྱས་གྲུབ་པར་སྨོན།
en: “Since sentient beings have now witnessed the power of my miraculous displays, They have given rise to the mind set on awakening And aspire to achieve buddhahood.

source: །འཁོར་འདིར་སྲོག་ཆགས་སུམ་ཁྲི་ཡིས།
en: “Within this retinue, thirty thousand beings

source: །ཆོས་འདི་བསྲུང་བར་དམ་ཡང་བཅས།
en: Have made a commitment to preserve this Dharma teaching,

source: །བདག་ཅག་སངས་རྒྱས་འདས་འོག་ཏུ།
en: Thinking, ‘After the Buddha passes away,

source: །མདོ་སྡེ་འདི་ནི་གདོན་བྱ་སེམས།
en: We shall recite this discourse.’

source: །དེ་དག་ང་ནི་འདས་པའི་འོག །མདོ་སྡེ་འདི་ནི་ཐོས་གྱུར་ནས།
en: “After I pass away, They will hear this discourse,

source: །བར་དང་ཐ་མའི་དུས་ཀྱི་ཚེ།
en: And, during the intermediate and final periods,

source: །ཇི་སྐད་བསྟན་བཞིན་སྒྲུབ་པར་འགྱུར།
en: They will practice it in accordance with the way it is taught.

source: །བྱང་ཆུབ་སེམས་བསྐྱེད་ཤིན་ཏུ་དཀའ། །སངས་རྒྱས་ཆོས་མོས་པ་ཡང་དཀའ། །ཐ་མའི་དུས་ཚེ་མདོ་སྡེ་འདི། །འཛིན་ཅིང་འདོན་པ་དེ་བས་དཀའ།
en: “It is extremely difficult to give rise to the mind set on awakening. It is extremely difficult to be inspired by the Dharma of the Buddha; But it will be even more difficult To uphold and recite this discourse during the final period.

source: །བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་དུ། །སངས་རྒྱས་འབྱུང་བ་ཤིན་ཏུ་དཀོན། །མ་འོངས་ཐ་མའི་དུས་ཀྱི་ཚེ། །མདོ་སྡེ་འདི་བཤད་དེ་བས་དཀོན།
en: “It is extremely rare for a buddha to appear, Even in ten trillion eons; But it will be even rarer for this discourse To be expounded in the future, during the final period.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ངས་མདོ་སྡེ་འདི་ཁྱོད་ལ་ཡོངས་སུ་གཏད་དོ།
en: Then the Blessed One said to the venerable Ānanda, “Ānanda, I entrust this discourse to you.

source: འཛམ་བུའི་གླིང་ན་ཇི་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་གནས་པ་དེ་སྲིད་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ཀུན་གནས་པར་འགྱུར་བས་སོ།
en: Because, as long as this discourse of the Bodhisattva Collection remains within the world, the entire Dharma of the Buddha will also remain.

source: །ཀུན་དགའ་བོ་འདི་ལྟ་བུའི་མདོ་སྡེ་ཟབ་མོ་འདི་ནུབ་པར་གྱུར་པའི་ཕྱིར་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མངོན་པར་བསྒྲུབ་པར་བྱ་བའི་ཆོས་ཀུན་ནུབ་པར་འགྱུར་རོ།
en: Ānanda, if such a profound discourse were to vanish, all the Dharma teachings that must be practiced as they are taught would also vanish.

source: །ཇི་སྐད་བསྟན་པ་བཞིན་དུ་བསྒྲུབ་པར་བྱ་བའི་ཆོས་ནུབ་པར་གྱུར་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཡང་ནུབ་པར་འགྱུར་རོ།
en: Because the Dharma teachings that must be practiced as they are taught would vanish, the teachings of the buddhas would also vanish.

source: །ཀུན་དགའ་བོ་དེང་ཁྱེད་ཀྱིས་མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པས་ང་ལ་མཆོད་པར་བྱའོ།
en: Ānanda, you should now worship me with the most sublime offerings.

source: །ཇི་ལྟར་ན་ཉན་ཐོས་རྣམས་ཀྱིས་མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པས་ང་ལ་མཆོད་པར་འགྱུར་ཞེ་ན།
en: In what manner should the hearers worship me with the most sublime offerings?

source: ཁྱོད་ཀྱིས་འདི་སྙམ་དུ་མེ་ཏོག་དང་། སྤོས་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། བྱུག་སྤོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ན་བཟའ་དང་། རོལ་མོ་སིལ་སྙན་མཆོག་དམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བསྔགས་པ་བརྗོད་པ་ནི་མཆོད་པ་མཆོག་དམ་པ་ཡིན་ནོ་སྙམ་དུ་བསམ་པར་མི་བྱ་སྟེ།
en: You should not think that the most sublime flowers, perfumes, fragrant powders, ointments, parasols, banners, standards, garments, and music, as well as the proclamation of the Thus-Gone One’s praises, are the most sublime types of offerings.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བུ་དེ་དག་ནི་མཆོད་པ་མཆོག་དམ་པ་ཞེས་མི་བྱའི།
en: Ānanda, they are not what is meant by the most sublime offerings.

source: གང་གིས་མདོ་སྡེ་ཟབ་མོ་འདི་ལྟ་བུ་ཐོས་ནས་ལེན་པ་དང་འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་། ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མངོན་པར་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱས་པ་དང་། བཀུར་སྟི་བྱས་པ་དང་། བླ་མར་བྱས་པ་དང་། བསྔགས་པ་བརྗོད་པར་བྱས་པ་ཞེས་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Rather, hearing such a profound discourse and adopting, memorizing, reading, reciting, and practicing it as it is taught—this is what is meant by ‘worshiping, venerating, respecting, honoring, and praising the Thus-Gone One with the most sublime offerings.’ Why is that?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་ཆོས་ལ་མཆོད་ཅིང་རིམ་གྲོ་དང་བསྙེན་བཀུར་མཛད་ཀྱི། འཇིག་རྟེན་པའི་མཆོད་པའི་ཡོ་བྱད་རྣམས་ལ་ནི་བཙུན་པར་མི་མཛད་པས་སོ།
en: Because all the thus-gone ones also worship, venerate, and revere the Dharma, but they do not hold worldly offerings in high esteem.

source: །དེ་ལྟ་བས་ན་ཀུན་དགའ་བོ་དེང་མདོ་སྡེ་འདི་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་ཁྱོད་ལ་ཡོངས་སུ་གཏད་པ་ཡིན་ནོ།
en: “Therefore, Ānanda, I now insist on entrusting this discourse to you.

source: ཀུན་དགའ་བོ་ངས་ཀྱང་མདོ་སྡེ་འདི་ཡང་དག་པར་བསླབས་པས་དེང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་བ་ཡིན་ནོ།
en: Because, Ānanda, by training in this discourse genuinely, I have awakened to unsurpassed and perfect buddhahood, and I am now turning the unsurpassed Dharma wheel.

source: །འདས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་མདོ་སྡེ་འདི་ཡང་དག་པར་བསླབས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་ཏོ།
en: When the buddhas of the past practiced bodhisattva conduct, they also trained in this discourse genuinely, and thus awoke to unsurpassed and perfect buddhahood and turned the unsurpassed Dharma wheel.

source: །མ་བྱོན་པའི་སངས་རྒྱས་རྣམས་ཀྱང་མདོ་སྡེ་འདི་ཡང་དག་པར་བསླབས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་བླ་ན་མེད་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: Likewise, the buddhas of the future will also train in this discourse genuinely, and thus will awaken to unsurpassed and perfect buddhahood and turn the unsurpassed Dharma wheel.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་པ་ཐམས་ཅད་ཀྱང་མདོ་སྡེ་འདི་ཡང་དག་པར་བསླབས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་དེང་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་བར་མཛད་པ་ཡིན་པས།
en: Also, all the buddhas who presently reside within the universes of the ten directions have also trained in this discourse genuinely, and thus they have awoken to unsurpassed and perfect buddhahood and are now turning the Dharma wheel.

source: དེའི་ཕྱིར་ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་ནི་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་བའི་འཁོར་ལོའི་མདོ་སྡེ་ཞེས་བྱ་བར་ཡོངས་སུ་གཟུང་བར་བྱའོ། །དུས་ཡུལ་བཱ་ར་ཎཱ་སིའི་རི་དགས་རྒྱུ་བའི་ཚལ་དུ་ཡང་ཉན་ཐོས་རྣམས་ལ་འདིས་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བསྐོར་ཏོ།
en: “Therefore, Ānanda, you should remember this discourse of the Bodhisattva Collection as The Sūtra of Turning the Wheel of Dharma. It is with this teaching that I turned the wheel of Dharma for the hearers in the Deer Park in Vārāṇasī.

source: །ཀུན་དགའ་བོ་ངས་དེང་འོད་མའི་ཚལ་འདིར་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་འདི་ཡོངས་སུ་བསྐོར་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་ཡོངས་སུ་བཅད་དོ།
en: Ānanda, today, within Veṇuvana, I have also turned this irreversible Dharma wheel, this discourse of the Bodhisattva Collection, and the doubts of all sentient beings have been eliminated.

source: །ཀུན་དགའ་བོ་འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་ནམ་མཁའི་ས་མཚམས་འདིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་ཡང་དག་པར་གསུངས་སོ།
en: Ānanda, here, at the edge of space, the thus-gone ones of the past also taught this discourse of the Bodhisattva Collection.

source: །མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་ནམ་མཁའི་ས་མཚམས་འདིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་ཡང་དག་པར་གསུང་བར་འགྱུར་རོ།
en: The future thus-gone ones will also teach this discourse of the Bodhisattva Collection here, at the edge of space.

source: །ངས་དེང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ནམ་མཁའི་ས་མཚམས་འདིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་མདོ་སྡེ་འདི་ཡང་དག་པར་བཤད་པས་དེའི་ཕྱིར་ས་གཞི་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཆོད་རྟེན་ཆེན་པོ་ལྷ་དང་མིར་བཅས་པའི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཆོད་པ་བྱ་བའི་གནས་སུ་གྱུར་པར་རིག་པར་བྱའོ།
en: After awakening to unsurpassed and perfect buddhahood, I have also expounded this discourse of the Bodhisattva Collection here, at the edge of space. For those reasons, you should know that this place has become a great reliquary of the thus-gone ones, which is to be worshiped by all the worlds with their gods and humans.

source: །ཀུན་དགའ་བོ་ས་གཞི་འདི་འབའ་ཞིག་ཐུན་མོང་མ་ཡིན་པའི་ཡོན་ཏན་འདི་ལྟ་སྟེ། འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་འདིར་མདོ་སྡེ་ཟབ་མོ་འདི་ཡང་དག་པར་གསུངས་པ་དང་ལྡན་པས།
en: Ānanda, this is so because this is the only place that has the unique quality of being the location where the thus-gone ones of the past have taught this profound discourse.

source: ཀུན་དགའ་བོ་འདི་ལྟར་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བཅས་པའི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་འོད་མའི་ཚལ་འདིར་ཞུགས་པར་གྱུར་ན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སློང་བར་མི་འགྱུར་རོ།
en: Ānanda, any sentient being afflicted by desire, anger, and ignorance who enters Veṇuvana, will, without exception, no longer give rise to desire, anger, and ignorance.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་གཙུག་ལག་ཁང་གཞན་ན་ཡང་བཞུགས་པར་གྱུར་མོད་ཀྱི། དེ་དག་གང་ལ་ཡང་འདི་ལྟ་བུའི་ཡོན་ཏན་མེད་དོ།
en: “Ānanda, thus-gone ones have certainly resided in other temples, but those places do not have the same qualities as this one.

source: ཀུན་དགའ་བོ་ཀ་ལན་ད་ཀ་དང་འོད་མའི་ཚལ་འདིར་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པ་དག་ཞུགས་པར་གྱུར་ན་ནི་འདོད་ཆགས་སྐྱེ་བར་མི་འགྱུར་ལ།
en: Because, Ānanda, when animals enter Kalandaka Forest and Veṇuvana, desire no longer arises in them;

source: བྱ་མང་པོ་ཞུགས་པར་གྱུར་ན་ནི་དུས་མ་ཡིན་པར་སྒྲ་མི་འབྱིན་པས་སོ།
en: and when flocks of birds enter this forest, they no longer sing at inappropriate times.

source: །ཇི་ལྟ་ཞེ་ན།
en: Why is it so?

source: ཡུལ་མ་ག་དྷའི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་སྤྱི་བོ་ནས་དབང་བསྐུར་ནས་དང་པོ་རྒྱལ་སར་ཞུགས་པའི་ཚེ་བཙུན་མོའི་འཁོར་དང་བཅས་ཏེ་སྐྱེད་མོས་ཚལ་འདིར་ཞུགས་ནས་ལྷན་ཅིག་ཏུ་རྩེ་བར་བྱས་པ་ལས་ཞུགས་མ་ཐག་ཏུ་བདག་ཉིད་འདོད་ཆགས་ཀྱི་རྩེད་མོ་བྱ་བའི་བསམ་པ་མེད་པར་གྱུར་པར་ཚོར་བར་གྱུར་ཏོ།
en: Because when Bimbisāra, the king of Magadha, visited his kingdom for the first time after being enthroned, he came to this forest, together with his retinue of queens, to frolic with them. However, as soon as he entered here, he felt that his desire for passionate frolicking had disappeared.

source: །བཙུན་མོའི་འཁོར་རྣམས་ཀྱང་སོ་སོ་ནས་འདོད་ཆགས་ཀྱི་སེམས་ཀྱིས་རྩེད་མོ་བྱ་བའི་བསམ་པ་མེད་པར་གྱུར་པ་ཚོར་བར་གྱུར་པ་དང་། དེའི་ཚེ་རྒྱལ་པོ་རབ་ཏུ་དགའ་བར་གྱུར་ནས་འདི་སྙམ་དུ་འཇིག་རྟེན་ན་སངས་རྒྱས་འབྱུང་ཞིང་བདག་གི་ཡུལ་དུ་བྱུང་བར་གྱུར་ན་བདག་གིས་མཐོང་བར་གྱུར་ཅིག །མཐོང་ནས་ཀྱང་སེམས་ཀྱིས་མངོན་པར་ཡིད་ཆེས་པར་གྱུར་ཅིག །མངོན་པར་ཡིད་ཆེས་པར་གྱུར་ནས་ཀྱང་མཆོད་པ་བྱེད་པར་གྱུར་ལ།
en: Everyone in the retinue of queens also felt that any desire for passionate frolicking had disappeared. At that moment, the king became utterly delighted and thought, ‘If a buddha appears in the world and comes to my country, may I meet him face to face. Upon meeting him, may I develop sincere trust in him. Having developed sincere trust, may I worship him.

source: སྐྱེད་མོས་ཚལ་འདི་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ཏེ།
en: I will offer this forest to that thus-gone one.

source: དེ་བཞིན་གཤེགས་པ་ཡང་འདིར་བཞུགས་པར་གྱུར་ནས་བདག་གིས་ཆོས་ཐོས་པར་གྱུར་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: May he reside in this place, and may I hear the Dharma from him. Why?

source: སྐྱེད་མོས་ཚལ་འདི་ནི་མཆོད་གནས་སུ་གྱུར་པ་དག་གི་གནས་ཡིན་གྱི །འདོད་པ་ལྔ་དང་མ་བྲལ་བ་དག་གི་གནས་ནི་མ་ཡིན་ནོ་སྙམ་དུ་སེམས་པས་སོ།
en: Because this forest is a place for those who are to be worshiped, not for those who are bound by the five sense desires.’
